<?php
/**
 * @copyright
 * @version 1.0.0
 * @link  
 */

return [
    'Auth'         => [
        'LoginRequest'         => [
            'country_code' => ['required' => ' الرجاء اختيار رمز البلد '],
            'account'  => ['required' => ' الرجاء إدخال حساب تسجيل الدخول ', 'alpha_dash' => ' شكل الحساب خطأ فقط دعم الحروف والأرقام ، فضلا عن داش والتأكيد على', 'between' => ' شكل الحساب خطأ ، 5-30 طول السلسلة '],
            'password' => ['required' => ' الرجاء إدخال كلمة السر ', 'alpha_dash' => ' شكل كلمة السر خطأ فقط دعم الحروف والأرقام ، فضلا عن داش والتأكيد على ', 'between' => ' شكل كلمة السر خطأ ، 6-30 طول السلسلة ']
        ],
        'PhoneLoginRequest'    => [
            'phone' => ['required' => ' الرجاء إدخال رقم الهاتف ', 'regex' => ' رقم الهاتف الخليوي شكل خاطئ '],
            'code'  => ['required' => ' الرجاء إدخال رمز التحقق من الرسائل القصيرة 6-bit ', 'size' => ' الرجاء إدخال رمز التحقق من الرسائل القصيرة 6-bit ']
        ],
        'RegisterRequest'      => [
            'country_id'      => ['required' => ' الرجاء اختيار البلد '],
            'country_code'    => ['required' => ' الرجاء اختيار رمز البلد '],
            'account'         => ['required' => ' الرجاء إدخال رقم الحساب ', 'alpha_dash' => ' شكل الحساب خطأ فقط دعم الحروف والأرقام ، فضلا عن داش والتأكيد على ', 'between' => ' شكل الحساب خطأ ، 5-30 طول السلسلة '],
            'password'        => ['required' => ' الرجاء إدخال كلمة السر ', 'alpha_dash' => ' شكل كلمة السر خطأ فقط دعم الحروف والأرقام ، فضلا عن داش والتأكيد على ', 'between' => ' شكل كلمة السر خطأ ، 5-30 طول السلسلة ', 'confirmed' => ' إدخال كلمة السر مرتين غير متناسقة '],
            'phone'           => ['required' => ' الرجاء إدخال رقم الهاتف ', 'regex' => ' شكل رقم الهاتف غير صحيح '],
            'code'            => ['required' => ' الرجاء إدخال رمز التحقق ', 'digits' => ' الرجاء إدخال رمز التحقق من أرقام 6-bit '],
            'invitation_code' => ['required' => ' الرجاء إدخال رمز الدعوة ']
        ],
        'ResetPasswordRequest' => [
            'country_code'    => ['required' => ' الرجاء اختيار رمز البلد '],
            'account'  => ['required' => ' الرجاء إدخال رقم الحساب ', 'alpha_dash' => ' شكل الحساب خطأ فقط دعم الحروف والأرقام ، فضلا عن داش والتأكيد على ', 'between' => ' شكل الحساب خطأ ، 5-30 طول السلسلة '],
            'password' => ['required' => ' الرجاء إدخال كلمة السر ', 'alpha_dash' => ' شكل كلمة السر خطأ فقط دعم الحروف والأرقام ، فضلا عن داش والتأكيد على ', 'between' => ' شكل كلمة السر خطأ ، 6-30 طول السلسلة ', 'confirmed' => ' إدخال كلمة السر مرتين غير متناسقة '],
            'phone'    => ['required' => ' الرجاء إدخال رقم الهاتف ', 'regex' => ' شكل رقم الهاتف غير صحيح '],
            'code'     => ['required' => ' الرجاء إدخال رمز التحقق ', 'digits' => ' الرجاء إدخال رمز التحقق من أرقام 6-bit '],
        ]
    ],
    'Account'      => [
        'ChangeAvatarRequest'   => [
            'avatar' => ['required' => ' يرجى تحميل الصورة الرمزية ', 'max' => ' صورة العنوان طول لا يمكن أن يتجاوز :max حرف ']
        ],
        'ChangeNicknameRequest' => [
            'nickname' => ['required' => ' أدخل الاسم المستعار ', 'max' => ' الاسم المستعار طول لا يمكن أن يتجاوز :max حرف ']
        ],
        'ChangePhoneRequest'    => [
            'phone' => ['required' => ' الرجاء إدخال رقم الهاتف ', 'numeric' => ' رقم الهاتف الخليوي شكل خاطئ ', 'digits' => ' رقم الهاتف المحمول شكل خاطئ : [:digits]طول '],
            'code'  => ['required' => ' الرجاء إدخال رمز التحقق من الرسائل القصيرة ', 'digits' => ' رمز التحقق من صحة الشكل خطأ digits بت عدد صحيح ']
        ],
        'ChangePasswordRequest' => [
            'old_password' => ['required' => ' الرجاء إدخال كلمة السر القديمة ', 'between' => ' طول كلمة السر القديمة هو طول سلسلة 6-30'],
            'password'     => ['required' => ' الرجاء إدخال كلمة السر الجديدة ', 'alpha_dash' => ' كلمة السر الجديدة على شكل أخطاء تدعم فقط الحروف والأرقام ، فضلا عن علامات داش والتأكيد على', 'between' => ' كلمة السر الجديدة شكل خاطئ ، 6-30 طول السلسلة ', 'confirmed' => ' إدخال كلمة السر مرتين غير متناسقة '],
            'trade_pass'   => ['alpha_dash' => ' السحب الجديد كلمة السر خطأ الشكل فقط دعم الحروف والأرقام ، فضلا عن داش والتأكيد على', 'between' => ' سحب كلمة السر الجديدة شكل خاطئ ، 6-30 طول السلسلة ']
        ],
        'ChangeIdCardRequest'   => [
            'id_card' => ['required' => ' الرجاء إدخال رقم الهوية ', 'size' => ' رقم بطاقة الهوية في شكل غير صحيح ']
        ],
        'ChangeBankRequest'     => [
            'bank_name' => ['required' => ' الرجاء اختيار نوع العرض '],
            'name'      => ['required' => ' الرجاء إدخال اسم ', 'between' => 'طول الاسم هو حرف 2.20 '],
            'account'   => ['required' => ' الرجاء إدخال رقم الحساب ', 'max' => ' الحد الأقصى لطول الحساب هو حرف 20 '],
            'trade_pass'   => ['required' => ' الرجاء إدخال كلمة السر ']
        ],
        'ChangeGenderRequest'   => [
            'gender' => ['required' => ' الرجاء اختيار الجنس ', 'in' => ' سوء الاختيار بين الجنسين ']
        ]
    ],
    'Task'         => [
        'SubmitRequest' => [
            'id'    => ['required' => ' الرجاء اختيار المهمة '],
            'image' => ['required' => ' يرجى تحميل لقطة مهمة ', 'max' => ' مهمة لقطة العنوان طول لا يمكن تجاوزها 255 حرف ']
        ],

        'TaskRequest' => [
            'category_id' => ['required' => ' الرجاء اختيار تصنيف المهام '],
            'level' => ['required' => ' الرجاء اختيار مستوى العضوية '],
            'title' => ['required' => ' من فضلك أدخل عنوان المهمة ', 'max' => ' لا يمكن أن يتجاوز طول رأس المهمة :max حرف '],
            'description' => ['required' => ' الرجاء إدخال وصف المهمة '],
            'url' => ['required' => ' أدخل عنوان المهمة الرابط '],
            'amount' => ['required' => ' الرجاء إدخال مبلغ المهمة '],
            'num' => ['required' => ' الرجاء إدخال رقم المهمة ', 'gt' => ' عدد المهام يجب أن تكون أكبر من 0 ']
        ]
    ],
    'UserRecharge' => [
        'ManualRequest' => [
            'level'    => ['required' => ' الرجاء اختيار مستوى الأعضاء لإعادة شحن ', 'gt' => ' خطأ في اختيار مستوى الأعضاء ، يرجى إعادة اختيار '],
            'trade_no' => ['required' => ' أدخل رقم خط الصفقة '],
            'image'    => ['required' => ' يرجى تحميل لقطات الدفع ', 'max' => ' دفع لقطة العنوان طول لا يمكن تجاوزها 255 حرف ']
        ],
        'OnlineRequest' => [
            'channel' => ['required' => ' الرجاء اختيار قناة شحن '],
            'level'   => ['required' => ' الرجاء اختيار مستوى الأعضاء لإعادة شحن ', 'integer' => ' خطأ في اختيار مستوى الأعضاء ، يرجى إعادة اختيار ', 'gt' => ' خطأ في اختيار مستوى الأعضاء ، يرجى إعادة اختيار ']
        ],
        'BankRequest'   => [
            'country_id' => ['required' => ' الرجاء اختيار البلد '],
            'bank_name'  => ['required' => ' الرجاء إدخال اسم البنك المحول '],
            'name'       => ['required' => ' الرجاء إدخال اسم المرسل '],
            'bank'       => ['required' => ' الرجاء إدخال رقم بطاقة التحويل '],
            'amount'     => ['required' => ' الرجاء إدخال مبلغ الشحن '],
            'remittance' => ['required' => ' الرجاء إدخال مبلغ التحويل ']
        ],
        'LevelRequest' => [
            'level' => ['required' => ' الرجاء اختيار مستوى شحن ']
        ]
    ]
];